app/views/likes/_like.html.erb

SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 59
---
      <span>
        <%= post.likes.count %>