app/views/likes/_sidelike.html.erb

              <span class="like-text">LIKE</span>
              <span class="num-of-like"><%= post.likes.count %></span>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 58