app/controllers/categories_controller.rb

  def show
    @post = Post.where(category_id: params[:id]).order("likes_count DESC").page(params[:page]).per(8)
    @category = Category.find(params[:id])
    @categories = Category.all
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`category_id` = 1  ORDER BY likes_count DESC LIMIT 9 OFFSET 0
SELECT COUNT(*) FROM `posts` WHERE `posts`.`category_id` = 1
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
SELECT `categories`.* FROM `categories`