app/controllers/likes_controller.rb

  def create
    @like = Like.create(user_id: current_user.id, post_id: params[:post_id])
    @likes = Like.where(post_id: params[:post_id])
    @post = Post.find(params[:post_id])
---
INSERT INTO `likes` (`user_id`, `post_id`, `created_at`, `updated_at`) VALUES (2, 59, '2019-03-28 12:03:24', '2019-03-28 12:03:24')
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 59 LIMIT 1