app/controllers/posts_controller.rb

  def index
    @post = Post.includes(:user).all.order("created_at DESC").page(params[:page]).per(9)
    @likes = Like.all
    @like = Like.where(post_id: params[:post_id])
    @categories = Category.all

    # post_ids = Like.group(:post_id).order('count_post_id DESC').limit(3).count(:post_id).keys

    to = Time.zone.now.yesterday.at_end_of_day
    from = (to - 7.day).at_beginning_of_day
    post_ids = Post.where(created_at: from...to).limit(5).order('likes_count DESC')
---
SELECT  `posts`.* FROM `posts`  ORDER BY created_at DESC LIMIT 9 OFFSET 0
SELECT COUNT(*) FROM `posts`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 3)
SELECT `categories`.* FROM `categories`
SELECT  `posts`.* FROM `posts` WHERE (`posts`.`created_at` >= '2019-03-10 00:00:00' AND `posts`.`created_at` < '2019-03-24 23:59:59')  ORDER BY likes_count DESC LIMIT 5

  def show
    @post = Post.find(params[:id])
    @posts = Post.where(category_id: @post.category_id).where.not(id: @post.id).order("likes_count DESC").limit(5)
    @comments = @post.comments.includes(:user)
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 58 LIMIT 1
SELECT  `posts`.* FROM `posts` WHERE `posts`.`category_id` = 2 AND (`posts`.`id` != 58)  ORDER BY likes_count DESC LIMIT 5
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 58

  def ranking
    @post = Post.includes(:user).all.order("created_at DESC").page(params[:page]).per(8)
    @likes = Like.all
    @like = Like.where(post_id: params[:post_id])
    @categories = Category.all
    # post_ids = Like.group(:post_id).order('count_post_id DESC').limit(12).count(:post_id).keys
    to = Time.zone.now.yesterday.at_end_of_day
    from = (to - 7.day).at_beginning_of_day
    post_ids = Post.where(created_at: from...to).limit(12).order('likes_count DESC')
---
SELECT `categories`.* FROM `categories`
SELECT  `posts`.* FROM `posts` WHERE (`posts`.`created_at` >= '2019-03-10 00:00:00' AND `posts`.`created_at` < '2019-03-24 23:59:59')  ORDER BY likes_count DESC LIMIT 12