app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @name = @user.name
    @nickname = @user.nickname
    # like = @user.like_posts
    @post = Post.where(user_id: @user.id).order("created_at DESC").page(params[:page]).per(8)
    @likes = Like.all
    @like = Like.where(post_id: params[:post_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `likes`.* FROM `likes` WHERE `likes`.`post_id` = 36 AND `likes`.`user_id` = 2 LIMIT 1